@nitrocode @Nuru Currently working on https://github.com/gruntwork-io/terraform-aws-eks/releases/tag/v0.48.0, seeing the below error

```
  # module.eks_cluster.aws_cloudwatch_log_group.control_plane_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "control_plane_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/eks-gvenkatesan/cluster"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.eks_cluster.null_resource.customize_aws_vpc_cni[0] will be created
  + resource "null_resource" "customize_aws_vpc_cni" {
      + id       = (known after apply)

      + triggers = {
          + "eks_cluster_endpoint"           = "https://BD3154E241F49386AA86A3959E915DB5.gr7.us-east-1.eks.amazonaws.com"
          + "enable_prefix_delegation"       = "false"
          + "sync_core_components_action_id" = "5862677358994836770"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Error: Creating CloudWatch Log Group failed: ResourceAlreadyExistsException: The specified log group already exists:  The CloudWatch Log Group '/aws/eks/eks-gvenkatesan/cluster' already exists.

  on .terraform/modules/eks_cluster/modules/eks-cluster-control-plane/main.tf line 212, in resource "aws_cloudwatch_log_group" "control_plane_logs":
 212: resource "aws_cloudwatch_log_group" "control_plane_logs" {
 ```
 
 Don't see any existing resource with that name to import as well
 
```aws-vault exec 'gvenkatesan' -- terragrunt state list | grep -i aws_cloudwatch_log_group```

Not sure if this is the right method to import 

```
 aws-vault exec 'gvenkatesan' -- terragrunt import module.eks_cluster.aws_cloudwatch_log_group.control_plane_logs[0] /aws/eks/eks-gvenkatesan/cluster
Error: resource address "module.eks_cluster.aws_cloudwatch_log_group.control_plane_logs[0]" does not exist in the configuration.

Before importing this resource, please create its configuration in module.eks_cluster. For example:

resource "aws_cloudwatch_log_group" "control_plane_logs" {
  # (resource arguments)
}

ERRO[0009] 1 error occurred:
        * exit status 1
        
```

Can you please suggest? Thanks